import streamlit as st
from openai import OpenAI

client = OpenAI(api_key=st.secrets["openai_api_key"])

st.title("Генератор тексту у вибраному стилі")

style = st.selectbox(
    "Оберіть стиль тексту:",
    ["Офіційний", "Креативний", "Науковий", "Академічний", "Формальний", "Мотиваційний", "Розповідь"]
)

prompt_styles = {
    "Офіційний": "Створи текст у формальному, офіційному чи офіційно-діловому стилі:",
    "Креативний": "Створи текст у форматі для використання рекламних банерів, сторітелінгу, презентацій, неймінгу, підписів для соцмереж і закадрових текстів вірусних роликів. Це можуть бути також маленькі слогани :",
    "Науковий": "Створи текст у науковому стилі: формальний, об’єктивний, з точними формулюваннями, нейтральною лексикою та безособовими конструкціями:",
    "Академічний": "Створи текст в академічному стилі: формулюй думки логічно, об’єктивно, з використанням складнопідрядних речень і термінів, властивих студентським і дипломним роботам. Уникай емоційної лексики.",
    "Формальний": "Поясни цей текст простою, формальною мовою:",
    "Мотиваційний": "Напиши цей текст як мотиваційне звернення:",
    "Розповідь": "Напиши цей текст у форматі вигаданної історії, це може бути казка чи фанфікшн:"
}

user_input = st.text_area("Введіть свій текст:")

if st.button("Згенерувати текст"):
    if user_input:
        full_prompt = f"{prompt_styles[style]} {user_input}"
        with st.spinner("Генерується..."):
            response = client.chat.completions.create(
                model="gpt-3.5-turbo",
                messages=[
                    {"role": "system", "content": "Ти професійний мовний редактор, який перетворює вхідний текст на граматично, лексично та стилістично бездоганний український текст у заданому стилі. Уникай русизмів, кальок і нетипових конструкцій."},
                    {"role": "system", "content": "Усі речення мають бути логічно зв’язані, лексика – відповідна до стилю, а пунктуація – коректною."},
                    {"role": "user", "content": full_prompt}
                ],
                max_tokens = 1000 ,
                temperature = 0.8
            )
            st.subheader("Згенерований текст:")
            st.write(response.choices[0].message.content)
    else:
        st.warning("Будь ласка, введіть текст.")
